[
    {
        "id": "G&S",
        "name": "Grim And Sons",
        "color": "#FF0700",
        "description": "Once upon a time, there were eight great clans upon the world of Donald's Rest. Their world was a cold place, with thin atmosphere. But the Clans were the greatest of the families that had founded the world, and they built for themselves a home on the tundras and mountains and sweeping plains. Then came Union. And with it, a world beyond the dreams of the Clans upon Donald's Rest. The Clans knew what came next, they were wise in their ways. They saw what Union offered. The chance to spread their families out beyond the hard and cold Donald's Rest. The risk of the great Corpro-States breaking down their ancient ways of living. There was only one option for them. It was Grimm Clan (Children of the Rails, Masters of the Old Vaults, Kings Of the Mountains) who lead the charge. They would become the Fatherclan, adopting the other seven great Clans as Sons. So it was, and so Grimm & Sons was born with the blessings of Union, a Corpro-State in name only.More truly they were a Corpo-Clan; and they set to work eagerly, aiding Union in building the Blinkgate for the Sommena System. It was there that the first of their mechs, the John Henry, was born. They never really looked back after that. G&S is famous in the outer rim of the Galaxy for their works building colonies and aiding fledgling frontier worlds in the taming of their wilderness. Heavy industry and civil engineering remain their breadwinners, praised almost universally. Their mechs however... G&S mechs have a reputation for unstable systems, strict ammo counts, and bizarre quirks. The great Corpro-Clan is good at a great many things, but Mech design is consistently not one of them. Despite its unprofitable nature for them, G&S pushes forward with their licensing programs out of pure ancestral love for the art of mech design.",
        "quote": "<i>Listen here son! These’ll keep you in the fight longer! S’where a pilot belongs anyway!</i>",
        "logo_url": "https://i.imgur.com/18sG5Yk.png"
    }
]