{
  "id": "mf_john_henry",
  "source": "G&S",
  "name": "JOHN HENRY",
  "mechtype": [
    "Striker"
  ],
  "image_url": "https://i.imgur.com/Oe7Noay.png",
  "y_pos": 18,
  "description": "Formerly an Industrial Mech meant for work both in Colony-building and in the maintenance of Solar Rails, the G&S John Henry is a legacy suite of tools and weapons meant for the dangerous work of building beyond the comfort of atmosphere. When the original Contract  with Union that gave birth to the John Henry was up; G&S were rich enough to play on the galactic field, but out of a job. So what did they do? They repackaged John Henry for military licensing, spinning a successful industrial mech into a battlemech and creating the rough and tumble legacy of Grimm & Sons. Without the John Henry, G&S would not exist.",
  "mounts": [
    "Main",
    "Heavy"
  ],
  "stats": {
    "size": 2,
    "armor": 2,
    "hp": 10,
    "evasion": 6,
    "edef": 6,
    "heatcap": 6,
    "repcap": 4,
    "sensor_range": 5,
    "tech_attack": -2,
    "save": 10,
    "speed": 3,
    "sp": 5
  },
  "traits": [
    {
      "name": "Heavy Frame",
      "description": "The John Henry cannot be knocked back or prone by actors smaller than itself"
    },
    {
      "name": "A Mighty Man",
      "description": "When John Henry inflicts knockback to a target with a melee attack, it may take 1 Heat (Self) to force the target to make a Hull Save or be knocked prone"
    },
	{
      "name": "Steel Driving Man",
      "description": "John Henry treats prone targets as Shredded when making melee attacks."
    },
	{
      "name": "Slow",
      "description": "John Henry has +1 Difficulty on Agility checks and saves"
    }
  ],
  "core_system": {
    "name": "RAIL-DRIVER",
    "description": "Born with a twenty ton hammer right in its hand, the G&S John Henry was designed to fulfill a UNION contract for the construction of Blinkgates and Solar Rails. With the massive mechs birth came the G&S Rail-Driver: An adamant compound hammer capable of the kind of work required on those massive projects. When the John Henry was repackaged for military use, the hammer was not removed. To do so, it was said, would kill the soul that made the mech.",
    "active_name": "Mountain-Powdering Blows",
    "active_effect": "For the rest of the scene, the Rail-Driver causes John Henry to take 4 heat. On hit, it deals 2d6+6 Konetic damage, in addition, you may place a Blast 1 with at least once space adjacent to you. All actors in this blast must make a Hull save or be immobilized until the end of your next turn and knocked prone. The original target makes this save at +1 Difficulty, even if they are not in the Blast. All objects in the blast take 30 AP kinetic damage from the shockwaves of your mighty hammer.",
    "tags": [
      {
        "id": "tg_protocol"
      },
	  {
	    "id": "tg_heat_self",
	    "val": 4
	  }
    ],
    "integrated": {
        "id": "GS_RAIL-DRIVER"
      }
  },
  "data_type": "frame",
  "aptitude": {}
}
